---
kind: method
id: M:Autodesk.Revit.DB.Element.GetMonitoredLinkElementIds
zh: 构件、图元、元素
source: html/42b25291-f1b9-d240-c876-1b53f24f60e0.htm
---
# Autodesk.Revit.DB.Element.GetMonitoredLinkElementIds Method

**中文**: 构件、图元、元素

Provides the link instance IDs when the element is monitoring.

## Syntax (C#)
```csharp
public IList<ElementId> GetMonitoredLinkElementIds()
```

## Returns
The IDs of linked instances.